fooapi-logstash/out/results.txt
Running 20s test @ http://api/weatherforecast
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   139.66ms   83.81ms 626.71ms   86.50%
    Req/Sec   261.94    120.62   611.00     67.44%
  Latency Distribution
     50%  120.82ms
     75%  160.49ms
     90%  223.40ms
     99%  537.91ms
  59748 requests in 20.10s, 37.68MB read
Requests/sec:   2972.59
Transfer/sec:      1.87MB